IRP/src/AccumulationRegisters/R5012B_VendorsAging/R5012B_VendorsAging.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>R5012B_VendorsAging</name>
  <resources>
    <name>Amount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <attributes>
    <name>AgingClosing</name>
    <type>
      <types>DocumentRef.VendorsAdvancesClosing</types>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Branch</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Agreement</name>
    <type>
      <types>CatalogRef.Agreements</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Partner</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Invoice</name>
    <type>
      <types>DocumentRef.PurchaseInvoice</types>
      <types>DocumentRef.DebitNote</types>
      <types>DocumentRef.CreditNote</types>
      <types>DocumentRef.OpeningEntry</types>
      <types>DocumentRef.SalesReturn</types>
      <types>DocumentRef.SalesInvoice</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PaymentDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>CurrencyMovementType</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
    </type>
  </dimensions>
  <dimensions>
    <name>TransactionCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

IRP/src/InformationRegisters/T2013S_OffsetOfAging/T2013S_OffsetOfAging.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>T2013S_OffsetOfAging</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Amount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Branch</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DocumentRef.SalesReportFromTradeAgent</types>
      <types>DocumentRef.CashPayment</types>
      <types>DocumentRef.PurchaseInvoice</types>
      <types>DocumentRef.DebitNote</types>
      <types>DocumentRef.CreditNote</types>
      <types>DocumentRef.BankReceipt</types>
      <types>DocumentRef.PurchaseReturn</types>
      <types>DocumentRef.DebitCreditNote</types>
      <types>DocumentRef.BankPayment</types>
      <types>DocumentRef.EmployeeCashAdvance</types>
      <types>DocumentRef.ChequeBondTransactionItem</types>
      <types>DocumentRef.CashReceipt</types>
      <types>DocumentRef.OpeningEntry</types>
      <types>DocumentRef.RetailReturnReceipt</types>
      <types>DocumentRef.SalesReturn</types>
      <types>DocumentRef.RetailSalesReceipt</types>
      <types>DocumentRef.SalesReportToConsignor</types>
      <types>DocumentRef.PurchaseOrderClosing</types>
      <types>DocumentRef.SalesOrderClosing</types>
      <types>DocumentRef.SalesInvoice</types>
    </type>
  </dimensions>
  <dimensions>
    <name>RecordType</name>
    <type>
      <types>EnumRef.RecordType</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Partner</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Agreement</name>
    <type>
      <types>CatalogRef.Agreements</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Invoice</name>
    <type>
      <types>DocumentRef.SalesReportFromTradeAgent</types>
      <types>DocumentRef.PurchaseInvoice</types>
      <types>DocumentRef.DebitNote</types>
      <types>DocumentRef.CreditNote</types>
      <types>DocumentRef.PurchaseReturn</types>
      <types>DocumentRef.OpeningEntry</types>
      <types>DocumentRef.SalesReturn</types>
      <types>DocumentRef.SalesReportToConsignor</types>
      <types>DocumentRef.SalesInvoice</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PaymentDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Key</name>
    <type>
      <types>DefinedType.typeRowID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

IRP/src/Enums/RecordType/RecordType.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>RecordType</name>
 <enumValues>
  <name>Expense</name>
 </enumValues>
 <enumValues>
  <name>Receipt</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/Companies/Companies.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Companies</name>
 <predefined>
  <items>
   <name>Default</name>
  </items>
 </predefined>
 <attributes>
  <name>Country</name>
  <type>
   <types>CatalogRef.Countries</types>
  </type>
 </attributes>
 <attributes>
  <name>MainCompany</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.CompanyLegalType</types>
  </type>
 </attributes>
 <attributes>
  <name>OurCompany</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostCurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostExpenseType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostFillEmptyAmount</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostPriceTypeForEmptyAmount</name>
  <type>
   <types>CatalogRef.PriceTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentStore</name>
  <type>
   <types>CatalogRef.Stores</types>
  </type>
 </attributes>
 <attributes>
  <name>TaxID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>MainPhoneNumber</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>SalaryAccrualVacation</name>
  <type>
   <types>CatalogRef.AccrualAndDeductionTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>SalaryMaxDaysVacation</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>3</precision>
   </numberQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>SalaryAccrualSickLeave</name>
  <type>
   <types>CatalogRef.AccrualAndDeductionTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>SalaryMaxDaysSickLeave</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>3</precision>
   </numberQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>SalaryBasicPayroll</name>
  <type>
   <types>CatalogRef.AccrualAndDeductionTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>PrintInfo</name>
  <type>
   <types>CatalogRef.PrintInfo</types>
  </type>
 </attributes>
 <attributes>
  <name>MainLegalAddress</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>1024</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>LegalCurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </attributes>
 <attributes>
  <name>BillingEmail</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>CurrencyRevaluationItem</name>
  <type>
   <types>CatalogRef.Items</types>
  </type>
 </attributes>
 <attributes>
  <name>CurrencyRevaluationItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </attributes>
 <attributes>
  <name>BatchID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>EntityID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <tabularSections>
  <name>Currencies</name>
  <attributes>
   <name>MovementType</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/AccumulationRegisters/R5012B_VendorsAging/ManagerModule.bsl
#Region AccessObject

// Get access key.
// See Role.TemplateAccumulationRegisters - Parameters orders has to be the same
// 
// Returns:
//  Structure - Get access key:
// * Company - CatalogRef.Companies -
// * Branch - CatalogRef.BusinessUnits -
Function GetAccessKey() Export
	AccessKeyStructure = New Structure;
	AccessKeyStructure.Insert("Company", Catalogs.Companies.EmptyRef());
	AccessKeyStructure.Insert("Branch", Catalogs.BusinessUnits.EmptyRef());
	Return AccessKeyStructure;
EndFunction

#EndRegion

Function R5012B_VendorsAging_Offset() Export
	Return 
		"SELECT
		|	CASE
		|		WHEN OffsetOfAging.RecordType = VALUE(Enum.RecordType.Receipt)
		|			THEN VALUE(AccumulationRecordType.Receipt)
		|		ELSE VALUE(AccumulationRecordType.Expense)
		|	END AS RecordType,
		|	OffsetOfAging.Period,
		|	OffsetOfAging.Company,
		|	OffsetOfAging.Branch,
		|	OffsetOfAging.Partner,
		|	OffsetOfAging.Agreement,
		|	OffsetOfAging.Currency,
		|	OffsetOfAging.Invoice,
		|	OffsetOfAging.PaymentDate,
		|	OffsetOfAging.Key,
		|	OffsetOfAging.Amount,
		|	OffsetOfAging.Recorder AS AgingClosing
		|INTO R5012B_VendorsAging
		|FROM
		|	InformationRegister.T2013S_OffsetOfAging AS OffsetOfAging
		|WHERE
		|	OffsetOfAging.Document = &Ref";
EndFunction

Function R5012B_VendorsAging_PI() Export
	Return 
		"SELECT
		|	VALUE(AccumulationRecordType.Receipt) AS RecordType,
		|	PaymentTerms.Ref.Date AS Period,
		|	PaymentTerms.Ref.Company AS Company,
		|	PaymentTerms.Ref.Branch AS Branch,
		|	PaymentTerms.Ref.Currency AS Currency,
		|	PaymentTerms.Ref.Agreement AS Agreement,
		|	PaymentTerms.Ref.Partner AS Partner,
		|	PaymentTerms.Ref AS Invoice,
		|	PaymentTerms.Date AS PaymentDate,
		|	SUM(PaymentTerms.Amount) AS Amount,
		|	UNDEFINED AS AgingClosing
		|INTO R5012B_VendorsAging
		|FROM
		|	Document.PurchaseInvoice.PaymentTerms AS PaymentTerms
		|WHERE
		|	PaymentTerms.Ref = &Ref
		|GROUP BY
		|	PaymentTerms.Date,
		|	PaymentTerms.Ref,
		|	PaymentTerms.Ref.Agreement,
		|	PaymentTerms.Ref.Company,
		|	PaymentTerms.Ref.Branch,
		|	PaymentTerms.Ref.Currency,
		|	PaymentTerms.Ref.Date,
		|	PaymentTerms.Ref.Partner,
		|	VALUE(AccumulationRecordType.Receipt)
		|
		|UNION ALL
		|
		|SELECT
		|	CASE
		|		WHEN OffsetOfAging.RecordType = VALUE(Enum.RecordType.Receipt)
		|			THEN VALUE(AccumulationRecordType.Receipt)
		|		ELSE VALUE(AccumulationRecordType.Expense)
		|	END,
		|	OffsetOfAging.Period,
		|	OffsetOfAging.Company,
		|	OffsetOfAging.Branch,
		|	OffsetOfAging.Currency,
		|	OffsetOfAging.Agreement,
		|	OffsetOfAging.Partner,
		|	OffsetOfAging.Invoice,
		|	OffsetOfAging.PaymentDate,
		|	OffsetOfAging.Amount,
		|	OffsetOfAging.Recorder
		|FROM
		|	InformationRegister.T2013S_OffsetOfAging AS OffsetOfAging
		|WHERE
		|	OffsetOfAging.Document = &Ref";
EndFunction

Function R5012B_VendorsAging_DebitNote() Export
	Return 
		"SELECT
		|	CASE
		|		WHEN OffsetOfAging.RecordType = VALUE(Enum.RecordType.Receipt)
		|			THEN VALUE(AccumulationRecordType.Receipt)
		|		ELSE VALUE(AccumulationRecordType.Expense)
		|	END AS RecordType,
		|	OffsetOfAging.Period,
		|	OffsetOfAging.Company,
		|	OffsetOfAging.Branch,
		|	OffsetOfAging.Partner,
		|	OffsetOfAging.Agreement,
		|	OffsetOfAging.Currency,
		|	OffsetOfAging.Invoice,
		|	OffsetOfAging.PaymentDate,
		|	OffsetOfAging.Amount,
		|	OffsetOfAging.Recorder AS AgingClosing
		|INTO R5012B_VendorsAging
		|FROM
		|	InformationRegister.T2013S_OffsetOfAging AS OffsetOfAging
		|WHERE
		|	OffsetOfAging.Document = &Ref
		|	AND OffsetOfAging.Recorder REFS Document.VendorsAdvancesClosing";
EndFunction

Function R5012B_VendorsAging_CreditNote() Export
	Return 
		"SELECT
		|	VALUE(AccumulationRecordType.Receipt) AS RecordType,
		|	PaymentTerms.PaymentDate AS PaymentDate,
		|	Transactions.Period AS Period,
		|	Transactions.Company,
		|	Transactions.Branch,
		|	Transactions.Currency,
		|	Transactions.Partner,
		|	Transactions.Agreement,
		|	PaymentTerms.DocRef AS Invoice,
		|	Transactions.Amount AS Amount,
		|	UNDEFINED AS AgingClosing
		|INTO R5012B_VendorsAging
		|FROM
		|	Transactions AS Transactions
		|
		|inner join PaymentTerms as PaymentTerms on
		|	PaymentTerms.DocRef = Transactions.AgingBasisDocument
		|	and PaymentTerms.Key = Transactions.Key
		|	and Transactions.IsVendor
		|	and Transactions.IsPostingDetail_ByDocuments
		|
		|UNION ALL
		|
		|SELECT
		|	CASE
		|		WHEN OffsetOfAging.RecordType = VALUE(Enum.RecordType.Receipt)
		|			THEN VALUE(AccumulationRecordType.Receipt)
		|		ELSE VALUE(AccumulationRecordType.Expense)
		|	END,
		|	OffsetOfAging.PaymentDate,
		|	OffsetOfAging.Period,
		|	OffsetOfAging.Company,
		|	OffsetOfAging.Branch,
		|	OffsetOfAging.Currency,
		|	OffsetOfAging.Partner,
		|	OffsetOfAging.Agreement,
		|	OffsetOfAging.Invoice,
		|	OffsetOfAging.Amount,
		|	OffsetOfAging.Recorder
		|FROM
		|	InformationRegister.T2013S_OffsetOfAging AS OffsetOfAging
		|WHERE
		|	OffsetOfAging.Document = &Ref
		|	AND OffsetOfAging.Recorder REFS Document.VendorsAdvancesClosing";
EndFunction

// Additional data filling.
// 
// Parameters:
//  MovementsValueTable - ValueTable
Procedure AdditionalDataFilling(MovementsValueTable) Export
	Return;	
EndProcedure
